src/body.xml

<?xml version="1.0" encoding="utf-8" standalone="yes" ?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" 
               xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
               xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <soap:Header>
    <dispositivo>GT-S1312L</dispositivo>
    <nomeSO>Android</nomeSO>
    <versaoAplicativo>1.1.1</versaoAplicativo>
    <versaoSO>4.1.4</versaoSO>
    <aplicativo>aplicativo</aplicativo>
    <ip>177.206.169.90</ip>
    <token>%s</token>
    <latitude>%s</latitude>
    <longitude>%s</longitude>
  </soap:Header>
  
  <soap:Body>
    <webs:getStatus xmlns:webs="http://soap.ws.placa.service.sinesp.serpro.gov.br/">
      <placa>%s</placa>
    </webs:getStatus>
  </soap:Body>
</soap:Envelope>
