src/main/resources/file/body.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XM LSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soap:Header>
    <b>samsung GT-I9192</b>
    <c>ANDROID</c>
    <d>4.4.2</d>
    <i>{LATITUDE}</i>
    <e>SinespCidadao</e>
    <f>10.0.0.1</f>
    <g>{TOKEN}</g>
    <k>{UUID}</k>
    <h>{LONGITUDE}</h>
    <l>{DATE}</l>
    <m>8797e74f0d6eb7b1ff3dc114d4aa12d3</m>
  </soap:Header>
  <soap:Body>
    <webs:getStatus xmlns:webs="http://soap.ws.placa.service.sinesp.serpro.gov.br/">
      <a>{PLATE}</a>
    </webs:getStatus>
  </soap:Body>
</soap:Envelope>