body.xml

<?xml version="1.0" encoding="utf-8" standalone="yes" ?>
<v:Envelope xmlns:v="http://schemas.xmlsoap.org/soap/envelope/">
  <v:Header>
    <b>LGE Nexus 5</b>
    <j></j>
    <i>{LATITUDE}</i>
    <c>ANDROID</c>
    <d>6.0.1</d>
    <e>4.1.5</e>
    <f>127.0.0.1</f>
    <g>{TOKEN}</g>
    <k>{UUID}</k>
    <h>{LONGITUDE}</h>
    <l>{DATE}</l>
    <m>8797e74f0d6eb7b1ff3dc114d4aa12d3</m>
  </v:Header>
  <v:Body>
    <n0:getStatus xmlns:n0="http://soap.ws.placa.service.sinesp.serpro.gov.br/">
      <a>{PLATE}</a>
    </n0:getStatus>
  </v:Body>
</v:Envelope>